# Equality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageKey..::..Equality Operator
FailureMessageKey Class See Also
---
Determines whether two FailureMessageKeys are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	FailureMessageKey first,
	FailureMessageKey second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As FailureMessageKey, _
	second As FailureMessageKey _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	FailureMessageKey^ first,
	FailureMessageKey^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..FailureMessageKeyThe first FailureMessageKey.
second
    Type: Autodesk.Revit.DB..::..FailureMessageKeyThe second FailureMessageKey.
# ### Return Value
True if the FailureMessageKeys are the same; otherwise, false.
# See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace